# vim: set filetype=ruby
# To install, run `brew bundle`

#
# Packages
#
brew 'asdf'
brew 'chafa'
brew 'deno'
brew 'direnv'
brew 'duckdb'
brew 'elixir'
brew 'eza'
brew 'fish'
brew 'flyctl'
brew 'git'
brew 'glab'
brew 'graphviz'
brew 'hub'
brew 'hugo'
brew 'julia'
brew 'lua-language-server'
brew 'mas'
brew 'neovim'
brew 'node'
brew 'pandoc'
brew 'pdfgrep'
brew 'pnpm'
brew 'postgresql@17'
brew 'python3'
brew 'ripgrep'
brew 'ruby'
brew 'ruff'
brew 'scc'
brew 'universal-ctags'
brew 'uv'

#
# Casks
#
cask 'amethyst'
cask 'dash'
cask 'forklift'
cask 'ghostty'
cask 'glyphs'
cask 'hammerspoon'
cask 'kindavim'
cask 'macai'
cask 'macvim'
cask 'marked'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
cask 'omniplan'
cask 'orbstack'
cask 'orion'
cask 'proxyman'
cask 'sketch'
cask 'tableplus'
cask 'tower'
cask 'xscope'

#
# Mac App Store
#
mas "Color Picker", id: 1545870783
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Kagi for Safari", id: 1622835804
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Swift Playground", id: 1496833156
mas "WorldWideWeb", id: 1621370168
mas "Xcode", id: 497799835

#
# Fonts
#
cask 'font-recursive-desktop'
cask 'font-recursive-code'
cask 'font-julia-mono'
