# vim: ft=ruby

# Command-line utilities
brew "asdf"
brew "awscli"
brew "caddy"
brew "chafa"
brew "composer"
brew "container"
brew "d12frosted/emacs-plus/emacs-plus"
brew "d2"
brew "ddev/ddev/ddev"
brew "doctl"
brew "duckdb"
brew "elixir"
brew "entr"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "flyctl"
brew "gh"
brew "git"
brew "glab"
brew "graphviz"
brew "hugo"
brew "hurl"
brew "imagemagick"
brew "julia"
brew "just"
brew "lf"
brew "midnight-commander"
brew "neovim"
brew "node"
brew "pandoc"
brew "postgresql@18"
brew "python"
brew "ripgrep"
brew "scc"
brew "sonar-scanner"
brew "task"
brew "timewarrior"
brew "typst"
brew "universal-ctags"
brew "uv"
brew "vale"
brew "wget"
brew "zk"

# Apps
cask "claude"
cask "claude-code"
cask "ghostty"
cask "orbstack"
cask "orion"
cask "quarto"
cask "emacs-plus"

# Fonts
cask "font-monaspace"
cask "font-asap"
cask "font-asap-condensed"
