# vim: set filetype=ruby
# To install, run `brew bundle`

tap 'elixir-tools/tap'

#
# Packages
#
brew 'direnv'
brew 'elixir'
brew 'eza'
brew 'fastfetch'
brew 'fish'
brew 'git'
brew 'glab'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'lilypond'
brew 'lua-language-server'
brew 'mas'
brew 'neovim'
brew 'next-ls'
brew 'node'
brew 'pandoc'
brew 'postgresql@17'
brew 'python3'
brew 'ruby'
brew 'stow'
brew 'tmux'
brew 'tpm'
brew 'tree'
brew 'universal-ctags'

#
# Casks
#
cask 'dash'
cask 'devonthink'
cask 'ghostty'
cask 'mactracker'
cask 'macvim'
cask 'marked'
cask 'marta'
cask 'omnigraffle'
cask 'orbstack'
cask 'orion'
cask 'proxyman'
cask 'tower'
cask 'xscope'

#
# Mac App Store
#
mas 'Flashtex: Learn Flashcards', id: 1534437697
mas 'GarageBand', id: 682658836
mas 'Gifski', id: 1351639930
mas 'Icon Preview', id: 6480373509
mas 'Kagi for Safari', id: 1622835804
mas 'Keynote', id: 409183694
mas 'Kindle', id: 302584613
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Playgrounds', id: 1496833156
mas 'System Color Picker', id: 1545870783
mas 'WorldWideWeb', id: 1621370168
mas 'Xcode', id: 497799835
mas 'iMovie', id: 408981434

#
# Fonts
#
cask 'font-balsamiq-sans'
cask 'font-recursive-desktop'
cask 'font-recursive-code'
cask 'font-shantell-sans'
